// ВСЕ ЗРОБИТИ СТРІЛОЧНИМИ ФУНКЦІЯМИ!
// - створити функцію яка обчислює та повертає площу прямокутника зі сторонами а і б
let areaRectangle = (a,b) => a * b;
console.log(areaRectangle(10,20));
//----------------------------------------------------------------------------------------------------------------------
// - створити функцію яка обчислює та повертає площу кола з радіусом r
let areaCircle = (r) => Math.PI*r*r;
console.log(areaCircle(2));
//----------------------------------------------------------------------------------------------------------------------
// - створити функцію яка обчислює та повертає площу циліндру висотою h, та радіутом r
let areaCylinder = (h, r) => 2 * Math.PI * r * (h + r);
console.log(areaCylinder(4, 6));
//----------------------------------------------------------------------------------------------------------------------
// - створити функцію яка приймає масив та виводить кожен його елемент
let arr = (array) => {
    for (const item of array){
        console.log(item);
    };
};
arr([11,22,33,44,55]);
//----------------------------------------------------------------------------------------------------------------------
// - створити функцію яка створює параграф з текстом. Текст задати через аргумент
let textMessage = (text) => document.write(`<p>${text}</p>`);
textMessage('Hello world!!!!');
//----------------------------------------------------------------------------------------------------------------------
// - створити функцію яка створює ul з трьома елементами li. Текст li задати через аргумент всім однаковий
let textMessage1 = (text) => {
    document.write(`<ul>
        <li>${text}</li>
        <li>${text}</li>
        <li>${text}</li>
    </ul>`)
}
textMessage1('HELLO');
//----------------------------------------------------------------------------------------------------------------------
// - створити функцію яка створює ul з трьома елементами li. Текст li задати через аргумент всім однаковий.
//   Кількість li визначається другим аргументом, який є числовим (тут використовувати цикл)
let textMessage2 = (text, a) => {
    document.write(`<ul>`)
    for (let i=0; i<a; i++){
        document.write(`<li>${text}</li>`)
    };
    document.write(`</ul>`);
};
textMessage2('h e l l o', 8);
//----------------------------------------------------------------------------------------------------------------------
// - створити функцію яка приймає масив примітивних елементів (числа,стрінги,булеві), та будує для них список
let arr_list = (arr) => {
    document.write(`<ul>`)
    for (const item of arr) {
        document.write(`<li>${item}</li>`)
    };
    document.write(`</ul>`);
};
let x = [1, 5, true, 'hello', {}, [1,2,3,4,5], false];
arr_list(x);
//----------------------------------------------------------------------------------------------------------------------
// - створити функцію яка приймає масив об'єктів з наступними полями id,name,age , та виводить їх в документ.
//   Для кожного об'єкту окремий блок.
let arr1 = (array) => {
    for (const item of array) {
        document.write(`<div>
           <div>id - ${item.id}</div> 
           <div>name - ${item.name}</div> 
           <div>age - ${item.age}</div> 
        </div>`)
    }
}
let a = [{id:1, name:'tamara', age:22}, {id:2, name:'olya', age:12}]
arr1(a)
//----------------------------------------------------------------------------------------------------------------------
// - створити функцію яка повертає найменьше число з масиву
let minNumder = (array) => {
    let min = array[0];
    for (const item of array) {
        if (item < min){
            min = item;
        };
    };
    return min;
};
let b = [5, 6, 87, 45, 9, 4, 12];
console.log(minNumder(b));
//----------------------------------------------------------------------------------------------------------------------
// - створити функцію sum(arr)яка приймає масив чисел, сумує значення елементів масиву та повертає його.
//   Приклад sum([1,2,10]) //->13
let sum = (arr) => {
    res = 0;
    for (const item of arr) {
        res += item;
    };
    return res;
};
console.log(sum([1,2,10]))
//----------------------------------------------------------------------------------------------------------------------
// - створити функцію swap(arr,index1,index2). Функція міняє місцями заняення у відаовідних індексах
//   Приклад  swap([11,22,33,44],0,1) //=> [22,11,33,44]
let swap = (arr,index1,index2) => {
    let index = arr[index1];
    arr[index1] = arr[index2];
    arr[index2] = index
    console.log(arr);
};
swap([11, 22, 33, 44], 0, 2);
//----------------------------------------------------------------------------------------------------------------------
// - Написати функцію обміну валюти exchange(sumUAH,currencyValues,exchangeCurrency)
// Приклад exchange(10000,[{currency:'USD',value:40},{currency:'EUR',value:42}],'USD') // => 250
let exchange = (sumUAH,currencyValues,exchangeCurrency) => {
    let res;
    for (let item of currencyValues){
        if (item.currency === exchangeCurrency){
            res = sumUAH / item.value
        }
    }
    return console.log(res);
}
exchange(10000,[{currency:'USD',value:40},{currency:'EUR',value:42}],'USD');